# BankDistanceSmallerThanDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..BankDistanceSmallerThanDiameter Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The distance value is smaller than the conduit diameter, please enter a larger value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BankDistanceSmallerThanDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BankDistanceSmallerThanDiameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BankDistanceSmallerThanDiameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace